{
  "stories": [
    {
      "id": "nj_19840512_002",
      "headline": "8 killed in Great Adventure fire",
      "date": "1984-05-12",
      "source": "Asbury Park Press",
      "text": "JACKSON TOWNSHIP — At least eight persons perished and eight were injured when a fire swept through the Haunted Castle attraction at Six Flags' Great Adventure amusement park last night.\n\nAll were visitors to the 500-acre amusement park and were believed to be teenagers, said Township Committeeman Richard Berry.\n\n\"Eight are known to have died and eight perished in the fire,\" Township Police Capt. Samuel DePasquale said. \"The fire spread so quickly because of the wind that apparently the victims had no time to escape.\"\n\nThe dead, burned beyond recognition, all were visitors to the 500-acre amusement park and were believed to be teenagers.\n\nAuthorities said they had to wait more than an hour while the rubble cooled before they could start picking through the debris.\n\n\"Initially, we thought they were mannequins, but then we knew something was wrong,\" Turnbach said.\n\n\"When I arrived,\" Assistant Fire Chief Samuel DePasquale said, \"the fire was engulfing the structure.\"\n\nWitnesses said the fire began about 6:35 p.m. and flames went as high as the trees. There was little billowing smoke — it was just a massive wall of flames, one witness said. \"It looked like a war zone.\"\n\nPark's visitors hear screams as flames soar, smoke billows\n\nJACKSON TOWNSHIP — Visitors to Six Flags' Great Adventure reported seeing \"big billows of smoke\" and \"flames as high as the trees\" as they realized something terrible was happening last night, and watched.\n\nOne of the photographers, John Fischetti, said he didn't see any panic among the patrons, \"just business as usual.\" Tom Flynn was walking toward Skeeball games. He said most people passing the Haunted Castle attraction as the fire started about 6:35 p.m. didn't see smoke until it was really bellowing out. The whole roof of the castle was covered with soot, said Joy Flynn, of Jackson Township.\n\n\"We were coming into the park, the whole sky lit up,\" said Mike Freeman, when the fire started. \"Even though we were about a mile away, we thought it was really bad. Smoke was billowing up into the air and everybody was still coming out of the park, and still others apparently entered to see what was going on.\"\n\nEventually, park officials decided to close the park and a stream of people was lined up on Route 537 to get out.\n\nPaul Bayer, Ocean County emergency management coordinator and chief of the Lakehurst Fire Co. for Ocean County Emergency Services, said the fire was brought under control — \"whatever that means\" — when he arrived.\n\n\"At 6:44 (the dead) would have to be identified through dental records,\" Turnbach said. \"But I know they were gathered together in one trailer, on a lit-up highway with everyone very upset.\"\n\nIn addition, an emotional woman gathered together with many people (as the park closed) handed out phone numbers and told a reporter that something traumatic had happened. They were very upset.\n\nTurnbach said it would take about a day or two to figure out who the victims were.\n\n\"A fairly thorough search was done,\" Bayer said. \"...I was shocked. Most of the victims were huddled together where there was nothing left to see that there was something there — an entrance or an exit, or smoke inhalation, trauma or all of the above.\"\n\nSome firefighters were treated at the scene for smoke inhalation, the Ocean County prosecutor's office said.",
      "location": "Jackson Township, New Jersey",
      "tags": [
        "unexplained",
        "youth_crime",
        "fire",
        "mass_casualty"
      ],
      "mythologization_score": 0.41500000000000004,
      "mythologized": false,
      "added": "2025-11-08T16:29:41.948092"
    },
    {
      "id": "nj_19860717_001",
      "headline": "Church desecration gets teen probation",
      "date": "1986-07-17",
      "source": "The Central New Jersey Home News",
      "text": "A 17-year-old Woodbridge boy was put on two-years' probation yesterday for desecrating a Roman Catholic church in Perth Amboy by spray painting Satanic symbols on the building and sidewalk.\n\nErnest J. Hennessy of Florida Grove Road in the Keasbey section of the township was sentenced by Superior Court Judge Richard S. Rebeck.\n\nRebeck also suspended Hennessy's one-year term in the New Jersey Training School for Boys and Girls in Monroe and ordered him to pay $600 toward cleaning up the spray-painted areas.\n\nAssistant Middlesex County Prosecutor Ernest Bergman had asked for a custodial sentence against Hennessy.\n\nPerth Amboy police arrested Hennessy on Jan. 10 outside Holy Spirit Church at Brace and Hazel avenues, four days after the church was marred by reddish paint sprayed on the columns.\n\nMiddlesex County Prosecutor Alan A. Rockoff, who announced Hennessy's arrest, said the youth marked the church with symbols of Satan — an upsidedown cross, \"666\" and the slogan, \"Satan Lives.\"\n\n\"Slayer,\" the name of a heavy metal rock group, was also sprayed on the church. Rockoff described Hennessy was a \"devoted follower\" of the group.\n\nPerth Amboy detectives were staking out the church on the night of Jan. 6-7 when Hennessy approached and began comparing the structure with photographs of the desecration from The News Tribune, a Woodbridge newspaper.\n\nPolice officers said Hennessy's jacket, sneakers and cap were stained with paint that matched paint found on the church.\n\nHennessy, who was 16 at the time of the offense, admitted a charge of criminal mischief — the actual spray painting. But he pleaded innocent and was tried for violating the state law against placing hate symbols or phrases on houses of worship.\n\nBergman said the judge also found Hennessy guilty of the latter offense.\n\nHennessy testified that he was neither motivated by satanism or heavy metal rock music. The defendant insisted he was simply intoxicated.\n\nJudge Rebeck also cleared Hennessy of a third offense — criminal mischief for toppling and damaging a $10,000 one-ton Italian-sculpted statue, \"Our Lady of the Rosary,\" on Dec. 13, 1985.",
      "location": "Perth Amboy, New Jersey",
      "tags": [
        "rock_bands",
        "youth_crime",
        "satanism",
        "unexplained"
      ],
      "mythologization_score": 0.405,
      "mythologized": true,
      "added": "2025-11-08T16:29:11.717198",
      "symbolic_object": {
        "category": "INFORMATION_ARTIFACTS",
        "description": "A black cassette tape labeled \"Mass in B Minor\" found inside the church organ chamber (sealed since 1952), containing inverted Latin prayers in backmasking. When played forward: baroque organ music. When played backward: liturgical chants to \"Solve et Coagula.\" Label handwritten in Gothic script matching the church's 1890s dedication plaque. Tape disappears from evidence locker in 1989 along with \"other Satanic Panic materials.\" Lab tech's transcription notes survive. The organ developed an E-flat harmonic that made parishioners nauseous - exorcised twice before being torn out and burned in 1986. Technician found claw marks inside the sealed chamber.",
        "inserted": "2025-11-08T16:39:41.865073"
      }
    },
    {
      "id": "nj_19880214_004",
      "headline": "Occult not sole cause of tragedy",
      "date": "1988-02-14",
      "source": "Daily Record",
      "text": "Continued from Page A1\n\nFleck, his school principal, \"died with Tom.\"\n\nYears before anyone jumped into the Satanism stuff as an explanation they should have looked at other possible causes, said Jerome Travers, a child psychologist for the former Catholic priest who has studied religious delusions.\n\n\"It's not a book that he read that caused him to kill his parents,\" Travers said, referring to three books on witchcraft in the boy checked out of the township library six days before the murder-suicide. \"It is what was going on inside him that caused it.\"\n\nTravers, who never met Tom but who has been following the case, said the boy had just experienced the first break with his parents sometime including religious delusions. Tom may have been in a severe family conflict that triggered the boy's rage. It appears Tom Sullivan Jr. died confused, angry and in turmoil, rebelling not only against his parents but against their conventions. It also appears the quiet 14-year-old was headed for trouble long before he showed any interest in Satanism. Interviews with neighbors and parents of the near-perfect child, \"the kind of boy you'd like for a son,\" as one neighbor described him, fit the normal life in the town.\n\nA gifted student, Tom earned a wrestling scholarship and from newspapers year-round to earn money. He was involved in sports, wrestling in a wrestling program and faithfully practiced matches. As a student he stood 5 feet, 7 inches tall, and he was strong. He worked out with weights in his bedroom to build his strength even more. He would sometimes sleep in his sweats, run five miles and force himself to run before matches to make weight, according to Nicholas, a school friend.\n\nHis principal described him as an average wrestler. Tom told a friend he planned to go to college on a wrestling scholarship. Young parents were, according to others, very happy with their son's success in their children's lives. Thomas Sullivan Sr., a hospital equipment salesman, worked with Tom at wrestling, and his mother told a neighbor she would even fake sick just to spend time with her son.\n\nTom's mother wanted him to get a job outside the house because she wanted to spend time with her son. \"They were a very close family,\" a neighbor, Dr. Alvin Stern, said.\n\nTom's days were full and carefully structured by his parents, police say. He followed the paper route in the morning, study time after school and wrestling meet nights. The boy had little free time, according to Police Chief Casper Stamer.\n\nBut in his unique free time, friends say, Tom slipped off the path he was on. Friends first noticed Tom's demeanor, his manner, had changed during the fall and definitely into the winter few of the adults who knew him would have suspected.\n\nHe began experimenting with alcohol in the fifth grade, said friends who drank with him and he puzzled liquor from his parents, he bragged of cheating on tests at school and would, the friends said, frequently drink in the bathroom.\n\nOnce he got caught, he said a friend whose name he wouldn't give, said he smoked marijuana and bragged about it before his friends said, frequently in the bathroom.\n\nTom's highly publicized interest in Satanism, which peaked just before the suicide to three books he checked out from the Fair Oaks Branch Library in Summit, apparently did not start that interest.\n\nHe began his studies shortly before his death at the Fair Oaks Branch Library. \"We visited several homes where Tom was visiting on Christmas vacation. He would come straight home from school to the living room of the small Cape Cod house and sit in a fire in the couch. His wife and son were not there. He looked depressed and was just staring down the driveway.\"\n\nNot long after, sometime before Christmas, Tom had an argument with his mother in which he cursed at her from his hands about 10 p.m. — Tom muttered words like his mother in words about it from Christmas vacation. His mother apparently was preparing for bed. She screamed him in the basement. She got a teen-slasher movie \"Friday the 13th\" was in the VCR, but nobody was watching it.\n\nPolice said there was no evidence of a struggle in any parts of the house where they lived. His mother said to each other, but the meeting is still under death.\n\nShe died on the floor near the family computer and her son was found a 6 feet away. She was stabbed more than a dozen times in the neck, back, and shoulders by a kitchen knife.\n\nTom left the basement, washed up and changed, then shot himself in a note he left that, police say, contained his mother's initial and a note inside that a short time after the murder he describes his mother's suicide type.\n\nThe note had no other text other than to say it indicated the killings were a mistake and they would kill him the day after the murder to describe his mother's suicide.\n\nThe boy probably felt trapped, Stamer theorizes, because the fact that Tom decided to kill himself.\n\n\"Looking back on it,\" Tom's classmates believe their friend changed so much the last days they said they knew about it. He wasn't his mother was no longer the one they knew. \"He wasn't like a classmate,\" Pfarr said in a statement. \"He was still a kind of person to do that to his mother,\" she'd play and a classmate, \"He was still nice.\"\n\nNick Ryder, another classmate, said he'd still be alive.\n\nSaid Michael's view, he'd still be alive.",
      "location": "Sparta, New Jersey",
      "tags": [
        "youth_crime",
        "satanism",
        "mental_health",
        "rock_bands"
      ],
      "mythologization_score": 0.405,
      "mythologized": false,
      "added": "2025-11-08T16:31:00.458276"
    },
    {
      "id": "nj_19840920_010",
      "headline": "Quietly, he crafts the 'Barth Vader'",
      "date": "1984-09-20",
      "source": "Daily Record",
      "text": "DOVER — Above Peter's Jewelers on Blackwell Street are a few small undistinguished rooms occupied by one of the town's lesser-known talents.\n\nTom Barth, a Dover native, conducts his \"triangle\" of businesses here. He teaches guitar, does some recording and crafts his own electric guitar known as the \"Barth Vader.\"\n\n\"It was Star Wars time,\" he says with a grin of embarrassment over the guitar's christening, but also with resignation.\n\nAt 34, Barth has been making guitars since 1976. He prefers hard woods — black walnut, ash, basswood — to craft the instruments. A Dover High School graduate, Barth says he's never had any formal instruction in guitar making. Instead, he learned the art the way mechanics learn their trade — by taking a guitar apart and putting it back together again.\n\n\"I started with repair work,\" he says. \"I saw how they made guitars for the industry and began figuring out how to make them better. Besides, there aren't too many schools to learn how to do it.\"\n\nHis last custom guitar devoured between 40 and 60 hours, he says, and cost about $1,000. He routs out the bodies on his band saw, glues the various parts together, sands them and then adds the electronics.\n\n\"I only know enough about electronics to assemble the parts,\" he says modestly. But his \"Barth Vader\" is somewhat unique in that he adds what he calls a graphic equalizer which allows the musician six tone controls.\n\nTeaching, repairing and band crafting, however, are only done to permit him to continue his true love — performing in a rock n' roll band known as \"Rocking New Jersey\" whose schedule includes local night clubs, private parties and weddings.\n\nThe name of the band can perhaps be linked to one of his favorite performers, Bruce Springsteen, who Barth claims has been one of the best influences in not only rock music, but its culture.\n\n\"It's a good, clean thing,\" he says. \"It's not violent, not stoney.\"\n\nWhile Barth isn't \"laughing all the way to the bank,\" as he puts it, he is doing what he wants to do, even if it means only a modicum of free time.\n\n\"It does get harder as the years go by,\" he admits, \"but I love it and the only reason I'm doing all this is to be able to get out and perform.\"",
      "location": "Dover, New Jersey",
      "tags": [
        "rock_bands"
      ],
      "mythologization_score": 0.4,
      "mythologized": false,
      "added": "2025-11-08T16:34:19.515263"
    },
    {
      "id": "nj_19800319_008",
      "headline": "Hypnosis helps police officers in re-creating scene of crime",
      "date": "1980-03-19",
      "source": "Asbury Park Press",
      "text": "YOU HAVE just been attacked. Bruised and terrified, you make your way to police headquarters where you are asked to provide a description of your assailant — and suddenly discover that you can't remember any of the details of the attack.\n\nForensic hypnosis could help you recall the incident and put police on the trail of possible suspects.\n\nAlthough it is not a new technique, forensic hypnosis only recently has begun to gain acceptance by law enforcement officials as a way to gather information and help victims, witnesses and even suspects recall details of a crime.\n\nThe technique has been used to provide information in cases of homicide, rape, arson, burglary, robbery and assault, according to Peter E. Stoessler, a hypnosis consultant and director of the Siegfried Hypnosis Center in East Brunswick Township.\n\nStoessler and ANY of former State Trooper Francis M. Trammell, a hypnosis instructor for The Family YMCA of Ocean County, Lakewood, are organizing a course in forensic hypnosis to be offered to police departments and officers.\n\nTrammell said he suggested the course after he was approached by two Lakewood officers interested in learning the technique.\n\nHypnosis was used several years ago in a case involving a hit-and-run death in Lakewood.\n\nIn November 1974, Rabbi Jacob Katz of Lakewood was hit and killed at the intersections of New Hampshire and County Line roads as he was trying to cross Route 9.\n\nThe hit-and-run suspect approached police as they were aiding the rabbi, then said he had to get his license and registration and returned to his car. When police looked for him minutes later, the man had disappeared.\n\nUnder hypnosis, a patrolman recalled the license plate number of a car believed to have struck the rabbi.\n\nA police investigation using the license plate number led to the arrest of a suspect about two weeks later in connection with the death.\n\n\"THE FACT that he remembered the license number is not the evidence — from that point it was up to the police to prove that that was the car (that struck the rabbi),\" Stoessler said.\n\n\"It (hypnosis) can be used to protect ... but it is never used to gain a confession or a conviction,\" he said.\n\nStoessler, who will teach the course for police officers with Trammell assisting, hopes that at least 10 officers and students.\n\nThe course is expected to be taught at the hypnosis center in East Brunswick. Stoessler said. He and all officers or departments who wish to take the course can contact him at the center or Trammell at the YMCA.\n\nIn addition to law enforcement officials, psychologists and lawyers have used forensic hypnosis to obtain additional information in a case. As a general witness or relax a client prior to taking a lie detector test, Stoessler said.\n\nContrary to the popular conception of hypnosis, he said, and individual is not asleep and is not controlled by the hypnotist. A hypnotic state is not a sleep and is not being controlled by the will.\n\nANYONE CAN hypnotized to varying degrees, provided the subject consents to hypnosis and does not resist, Trammell said.\n\nA person under hypnosis may lose some sense of time, but will remember all or portions of the session and can be brought back to full consciousness at any time.\n\nNew Jersey has no law governing the use of forensic hypnosis to ensure that the information obtained will be admissible as evidence by the courts, Stoessler said.\n\nSESSIONS SHOULD be videotaped whenever possible, or at least tape recorded, he said.\n\nVideotapes are preferred because they prove that sections of tape have not been spliced and provide a visible record of the hypnotist, client, law enforcement officials and lawyers present, Stoessler said.\n\nThe manner in which the hypnosis session is conducted must ensure court scrutiny, he noted.\n\n\"If (the courts determine) you're leading the witness, the information is automatically thrown out as evidence because the questions might have put words in their mouth,\" he said.\n\nOnly certain questions can be asked to avoid producing \"leading\" or \"pseudo-memories,\" he said.\n\nPseudo-memories may result when a hypnotist asks \"leading\" questions. In such cases the subject may \"recall\" something that never actually happened, he said.\n\nIF THE VICTIM then recalls a hand with a scar, a set ring or some other specific information, the hypnotist can proceed to question the victim about those specific recollections.\n\nFor example, an assault victim remember a hand grabbed you, describe his hands or any part of his body you can remember, he suggested.\n\n\"A good question to ask would be, 'As the assailant grabbed you, describe his hands or any part of his body you can see,'\" Stoessler said.\n\nStudents also will learn the legal aspects and characteristics or events that are applicable to ensure that the information obtained will be accepted as evidence by the courts.\n\nParticipants in the six-week courses at the center will be trained in applying hypnosis. The forensic aspects and taught to apply these techniques to questioning and working with witnesses, victims or suspects.\n\n\"Hypnosis is always used to give you the lead — the missing link — but you need more information to go on,\" he said.\n\nFurther police investigation is necessary before any arrest can be used as evidence in making arrests, he said.\n\n\"All sorts of emotional factors play a role in hypnosis, and the hypnotist has to be aware of this and phrase his questions accordingly,\" he noted.\n\nA system of ethics for revenge could be under hypnosis and deliberately accuse an innocent of a crime, he explained.\n\nINFORMATION OBTAINED through hypnosis is not sufficient for police to immediately arrest anyone, Stoessler emphasized.\n\nA Los Angeles police survey of 878 cases involving hypnosis from 1975 to April 1979 showed that new information obtained through hypnosis was utilized in 80.2 percent of the 126 cases solved.\n\n\"Hypnosis is always used to give you the lead — the missing link — but you need more information to go on,\" he said.",
      "location": "East Brunswick Township, New Jersey",
      "tags": [
        "mental_health",
        "unexplained"
      ],
      "mythologization_score": 0.31500000000000006,
      "mythologized": false,
      "added": "2025-11-08T16:33:20.791855"
    },
    {
      "id": "nj_19920220_003",
      "headline": "Five teens charged in bizarre death plot against Clifton boy",
      "date": "1992-02-20",
      "source": "The Courier-News",
      "text": "CLIFTON (AP) — A 17-year-old strangled as he sat praying in his father's car was the target of an earlier death plots by five teen-agers who met in weekly planning sessions since November, authorities said yesterday.\n\nRobert Solimine Jr. of North Haledon was throttled with an extension cord by a 17-year-old acquaintance sitting behind him in the back seat and proceeded to strangle him as they prayed a \"Hail Mary,\" Passaic County Prosecutor Ronald Fava said.\n\n\"When they got to the line, 'Now and at the hour of death,' he flipped his cord around his seat and proceeded to strangle Mr. Solimine,\" Fava said.\n\nSolimine's body was found in the car at 12:30 a.m. Monday morning in a school parking lot. The killing happened sometime after 11 p.m. Sunday night.\n\nTwo 17-year-olds, two 14-year-olds and Frank Castaldo, 18, are accused of murder. All are from Clifton. Names of the juveniles were not released by authorities.\n\nCastaldo was not present at the time of the killing, but the youths met with him before it and afterward, Fava said.\n\nThe 17-year-old alleged killer bought religious medals with an image of St. Joseph and the infant Jesus for the members of the group as a symbol of solidarity, Fava said.\n\nAuthorities are puzzled about the motive.\n\n\"There is no reason that rises to the level of what a reasonable, rational person would consider a motive for murder. There was some indication (Solimine) wasn't their favorite person, that he was considered something of a pest.\n\n\"But those are reasons not to invite someone to your birthday party; they do not rise to level of wanting to kill someone,\" he said.\n\nFava said the group began in November at Castaldo's home to plan to harm Solimine. They first considered vandalism, such as slashing tires, then escalated to planning physical harm and then murder, Fava said.\n\n\"At some of these meetings, they would begin with readings from the Bible,\" Fava said.\n\nTwo earlier death plots failed. In the first attempt in January, the group planned to force an aerosol can into Solimine's gas tank, thinking it would heat up and explode as he drove the car, Fava said. They were unable to force the can down the gas pipe, and if they had, gas tanks do not get hot, Fava said.\n\nOn Saturday, the night before the murder, the group planned to trick Solimine into handcuffing himself to his steering wheel, then they would set fire to the car, Fava said.\n\n\"They were going explain they were some kind of trick handcuffs, and see how long it would take him to get out. He apparently was suspicious enough to decline to be handcuffed,\" Fava said.\n\nFava said Castaldo appeared to be the group's leader.\n\n\"The 18-year-old appears to have had some control over the group. He ran the meetings,\" he said. \"He had approval or veto power over plans.\"\n\nEarly Tuesday, charges had only been filed against the 17-year-old accused of actually strangling Solimine and a 14-year-old who was in the car with him.",
      "location": "Clifton, New Jersey",
      "tags": [
        "youth_crime",
        "unexplained",
        "mental_health",
        "ritual"
      ],
      "mythologization_score": 0.30500000000000005,
      "mythologized": false,
      "added": "2025-11-08T16:30:12.463044"
    },
    {
      "id": "nj_19820731_005",
      "headline": "Type of LSD linked to teen's death is rising in use",
      "date": "1982-07-31",
      "source": "The Courier-News",
      "text": "Law enforcement officials say the \"blotter\" LSD that allegedly led to the accidental death of a Watchung teen last Saturday is the most common form of the drug used in Central Jersey, seen in an increasing number of cases in some towns in the past year.\n\nMichael Fitzpatrick, 19, of 91 Hillcrest Road, died last Saturday morning after he plunged his arm through a plate glass door. Nearly severing the artery at the elbow, while allegedly gathering at a friend's at a Warren home the previous night. Warren police Chief Robert Smith said it appears a mixture of alcohol and the hallucinogenic drug led to Fitzpatrick's accident.\n\nOn Thursday night, Warren police arrested Scott Keating of 5 Brady Road, Warren, and charged him with distributing LSD to Fitzpatrick.\n\nIf convicted, he could face a penalty of 12 years in jail, a $25,000 fine or both, according to an Assistant County Prosecutor Michael Rosenberg.\n\nBlotter acid is a sheet of paper that has been impregnated with the drug, usually with some type of picture applied to the paper, Gray said.\n\nIn 1980 and 1981, warnings were issued throughout New Jersey about LSD use of blotter LSD in the past year, particularly in the \"blotter\" acid form, said State Police Capt. Charles Gray of the State Police Narcotics Division.\n\nBlotter acid bears pictures of pyramids dancing bears and other images. He said a person licks the stamp or a small square acid tab which produces hallucinations mood changes.\n\nSide effects can include panic reactions, prolonged reactions, suicidal and homicidal behavior.\n\nGray said that this year blotter LSD has risen this year in Sussex County to its popular.",
      "location": "Watchung, New Jersey",
      "tags": [
        "psychedelics",
        "youth_crime",
        "unexplained"
      ],
      "mythologization_score": 0.30000000000000004,
      "mythologized": false,
      "added": "2025-11-08T16:31:21.255970"
    },
    {
      "id": "nj_19750720_006",
      "headline": "Mind Control Advocate Extols Subconscious Power",
      "date": "1975-07-20",
      "source": "Sunday Daily Record",
      "text": "MORRIS PLAINS — The problem, the slight, gray-haired man was saying, is that we have become too \"beta-bound.\"\n\nWith the help of an electronic tracking device, Jose Silva, founder of Silva Mind Control, the method to \"help you become more humane,\" was sinking into alpha.\n\nThe silence became more pronounced in the room as the beeps indicating beta or conscious mental activity slowed down deeper into the subconscious regions of alpha.\n\nThen, with rapid hand and wrist flexes, Silva surfaced again and opened his eyes to the world of beta.\n\nIn town this weekend to help promote the method through a new graduate course, Silva visited the Mind Control bookstore named after him at 1012 Mount Tabor Road.\n\nMind control, Silva said, to the small audience of observers seated in the training room adjoining the bookstore, is a \"method of mental training which helps human beings use the subconscious consciously.\"\n\nHe speaks softly, this man who has triggered a movement with more than half a million devotees worldwide. The promises of what mind control yields are almost as numerous as the numbers of individuals who join the introductory $175 course.\n\nNew jobs, better education, improved relationships — the list is endless. Because as \"persons become healthier, more productive, they become problem-solvers,\" Silva says.\n\n\"We're using another dimension of the brain,\" he explained. And there are no limitations, in his opinion, to the power of that facility. \"You become more developed. It's like,\" he says, straining to relate to the uninitiated, \"using two tool boxes to do the job instead of one.\"\n\nSilva's own interest in psychology was triggered during some testing he was in the Army in 1944. \"I wondered what that man was doing to me,\" he remembers. Later as an electronic engineer, Silva, a Mexican-American who began with three years of formal education, became interested in knowing \"if we could arrest frequency.\"\n\nHe likened the brain to a transmitter-receiver unit. \"When impedance equals zero,\" he discovered, \"there is minimal opposition to resistance and the greater use of electrical energy. Then,\" he beams, \"you've reached resonance.\"\n\nIn other words, you're there. \"In synchronization, in step, and not wasting energy,\" according to mind control principle. You've reached alpha — sleeping consciousness one step beyond the limits of conscious beta — the \"resonant point\" in the brain.\n\nBy 1966, Silva and several groups had experimented with several groups of people in his native Texas. He began to branch out in 1970, and barely five years later mind control is an accredited course in some high schools, with several universities due to follow suit.\n\n\"The reason for success is a simple one for Silva. \"You change your way of thinking,\" he claims. \"You just don't want to use other people. You cannot think evil at alpha. If you did, you would get bounced back to beta.\"\n\nFor a brave new world is the ultimate goal of mind control. Silva himself will admit his \"ultimate goal\" is to have \"everyone\" learn mind control.\n\nThere are tests under way now analyzing whether children \"inherit\" the mind control principle from parents who demonstrate that principle in their lives.\n\nThus, he enthuses, mind control is \"the first step of the second phase of human evolution of the planet. The world will become a better place, in short.\n\nThere are many questions yet unanswered Silva will admit to. \"Mind control is a hypersensitive means of perceiving information the means of which we don't yet understand fully.\" Present tests also have gotten \"interesting feedback\" from a force Silva conceptualizes as the \"center of the galaxy.\"\n\n\"We have reason to believe,\" he says, smiling, \"the results have been so promising, that there's something there.\"\n\nBecause, after all, \"alpha is the direction we came from.\"",
      "location": "Morris Plains, New Jersey",
      "tags": [
        "mental_health",
        "unexplained",
        "psychedelics"
      ],
      "mythologization_score": 0.21000000000000002,
      "mythologized": false,
      "added": "2025-11-08T16:32:00.469517"
    },
    {
      "id": "nj_19831208_000",
      "headline": "'No Goals, No Future' - Polish Punk Stirs Youth Culture",
      "date": "1983-12-08",
      "source": "Vineland Times Journal",
      "text": "WARSAW, Poland (AP) - As a crowd of young punks brawled on the dance floor, the lead singer for Dezerter - the deserter - screamed out an anthem to what he called Poland's \"miscarried generation: No goals, no future, no hope, no joy.\"\n\nThe singer hurled stacks of government and Communist Party newspapers into the crowd of 200, while shrieking the word \"propaganda.\" The title of the song was \"News.\"\n\nThe teen-agers shredded the papers, and lunged at each other with fists, feet, legs, and bodies in a desperate frenzy which resembled a fight more than a dance.\n\nThe Polish punk rock movement is small - several thousand, according to long-time observers of the Polish musical scene - and typifies the lag in popular culture between Western and Eastern Europe. But it reflects the disorientation of many Polish youth.\n\n\"I like punk because it's the only music which lets us get our aggression out,\" said one 18-year-old boy, wearing a studded leather jacket and cropped blond hair that he stood on end by donating in sugar-saturated water.\n\n\"If Solidarity is said to find in Poland, where clothes of all kinds are scarce, he said, grinning, 'but we steal them.'\"\n\nWhile looking to the West for musical and other cultural values, Polish teen-agers feel themselves firmly in the political grip of the Soviet bloc.\n\nPoland's communist authorities barely tolerate punk but see it as a \"safety valve\" for the nation's disaffected youth, according to one sociologist.\n\nRecent times have been confusing for Polish teen-agers, who first lived through the heady upheaval led by the now-outlawed Solidarity labor federation, then endured 18 months of martial law.\n\nNow they face an economic crisis which many say will confine them to frustrating jobs and deny them a house of their own until they reach middle age.\n\n\"Why were if you have to wait 20 years for an apartment?\" asks 16-year-old Rikardai, lead singer for Dezerter and a vocation school drop-out who refuses to give his real name.\n\nJerry Kordowicz, a disc-jockey for state-run Polish radio, said in a recent interview that \"Polish punk is a social phenomenon rather than a musical one. It is the spontaneous protest of a generation, not only in political matters but in cultural ones as well.\"\n\nState radio which regularly features Western rock bands, rarely broadcasts Polish punk, Kordowicz says, because \"the lyrics of punk songs don't deserve to be played over the radio.\"\n\nIts aim of radio is to popularize certain cultural values,\" he said.\n\nGovernment censorship blocks most Polish punk from the airwaves, and bans some songs from concert. Last year Dezerter was called SS-20, after the new generation of Soviet nuclear missiles, but dropped the name after authorities refused to print a poster for the group. The group renamed itself Dezerter - a controversy name in martial law Poland.\n\nAnother rock band, Perfect, came under government harassment when it began replacing the line \"We want to be ourselves\" in one song with \"We want to beat ZOMO,\" a reference to Poland's riot police.\n\nAnother Perfect lyric, \"Don't be afraid of anyone,\" became, in concerts, \"Don't be afraid of Jaruzelski,\" a jab at Poland's leader Gen. Wojciech Jaruzelski. It also upset authorities.\n\nPunk groups have also been banned from giving concerts from time to time - such was the case during Pope John Paul II's visit to his homeland in June.\n\n\"Punk here is just like anywhere in the world,\" says Dezerter manager Tomasz Wisniewski. \"Punks here don't respect the authorities, but playing punk here is more difficult, because of the censorship and hard to get instruments,\" says Kordowicz. For the most part, only those bands that cross the line from punk to music with more popular appeal have recorded albums by the state recording monopoly, he said.\n\nMost of the 100 or so new wave bands are amateurs, according to Kordowicz.",
      "location": "Vineland, New Jersey",
      "tags": [
        "rock_bands",
        "youth_culture",
        "international_connections",
        "censorship"
      ],
      "mythologization_score": 0.2,
      "mythologized": true,
      "added": "2025-11-08T13:58:00.871736",
      "symbolic_object": {
        "category": "INFORMATION_ARTIFACTS",
        "description": "A bootleg cassette tape of Dezerter's \"SS-20\" concert, smuggled from Warsaw to Newark in December 1983, arrives in a Christmas package addressed to Henrietta Tomachevski. The tape is wrapped in shredded Trybuna Ludu newspapers. Her grandson finds it while visiting. His grandfather, Newark Police Chief/Deputy Chief, is in the next room watching the evening news about martial law crackdowns. The tape's handwritten label reads \"Dla rodziny - nie słuchaj policji\" (For family - don't listen to the police). It will circulate through Vineland and Newark punk scenes for years, each dubbing degrading the audio but amplifying the mythology of \"the Chief's tape.\"",
        "inserted": "2025-11-08T13:59:56.287917"
      }
    },
    {
      "id": "nj_19800501_009",
      "headline": "Cops Raid 1 Home 2 Times",
      "date": "1980-05-01",
      "source": "The Press (Atlantic City)",
      "text": "VINELAND — Five fish tanks containing hallucinogenic \"magic mushrooms\" and more than $1,000 worth of marijuana were confiscated by police during two separate raids on a Howard Street home here Tuesday afternoon and early Wednesday morning, police said.\n\nThree persons, including the daughter of the head of the Comprehensive Employment and Training Act program, were arrested on various charges following two separate raids on the first and second floors of the home on the first block of Howard Street, police said.\n\nCharged with possession with intent to manufacture a hallucinogenic drug (psilocybin mushrooms) was Cliff Smalley, 27, of the Howard Street home. Smalley is being held in Cumberland County Jail in lieu of $1,000 bail.\n\nArrested at the Vineland State School where she works was Florida Mary Nocco, 26, also of the Howard Street home, whose father, William, heads the CETA program here. Miss Nocco was charged as a disorderly person for allegedly removing the proper label from the original container of a prescription drug she was issued a summons and released.\n\nAlso arrested was William Kenneth Herring, 28, of the Howard Street address. Herring was charged with possession of a controlled dangerous substance (over 25 grams) with intent to distribute. He was freed on $10,000 bail.\n\nThe second raid took place at 12:05 a.m. when five police officers armed with a search warrant to the second floor apartment of Cliff Smalley and Kenneth Dickenson, no given. Police said Smalley, who opened the door, said at the time he didn't know where Dickenson was wherabouts.\n\nInside the apartment, police allegedly found five fish tanks with \"magic mushrooms\" growing inside them had been placed in the tanks in order to grow the psilocybin mushrooms, police said.\n\nAccording to police, other drug-related paraphernalia was uncovered in the kitchen and bathroom. Police also allegedly found a small amount of marijuana (under 25 grams).\n\nSmalley has a charge against whom charges are pending, allegedly (Continued on Page 44)",
      "location": "Vineland, New Jersey",
      "tags": [
        "psychedelics",
        "youth_crime"
      ],
      "mythologization_score": 0.10500000000000001,
      "mythologized": false,
      "added": "2025-11-08T16:33:54.335785"
    },
    {
      "id": "nj_19900213_007",
      "headline": "N.J. man leads quest for the 'unexplained'",
      "date": "1990-02-13",
      "source": "Press of Atlantic City",
      "text": "LITTLE SILVER — \"You're not going to believe this, but...\"\n\nThat's the way many phone conversations begin at the home of Robert C. Warth, president of the Society for the Investigation of the Unexplained.\n\nThe group, which Warth claims has \"thousands\" of members across the globe, investigates everything from lights in the sky to household ghosts in a quest to provide scientific facts about things most of us consider science fiction.\n\n\"We're interested in just about all unexplained phenomena. We try to keep up with everything and report to our members,\" Warth said.\n\nA recent edition of the organization's quarterly journal, \"Pursuit,\" is filled with articles providing scholarly updates on such topics as possible methods of UFO propulsion, the sighting of a food-tail lizard man in South Carolina and references to werewolves in Shakespeare's plays.\n\nWhile group members claim there is more than a germ of truth in most tales of the unexplained, Warth said the organization doesn't try to force its views on unbelievers.\n\n\"We don't take any stands on ed skepticism,\" Warth said. \"If someone is interested in the unexplained we only ask them to read both sides, do their own research and think.\"\n\nBut Warth is a true believer. He counts psychic speller Uri Geller among his close friends, and claims another psychic friend healed his wife who suffered a kidney ailment.\n\nHe claims to have seen UFOs and believes almost everyone has some untapped psychic ability.\n\n\"One of the biggest problems we have as human beings is that we are very limited by our vision. We don't believe in something unless we can see it,\" he said.\n\n\"Pursuit\" is published from a spare bedroom on the second-floor of Warth's Victorian home in Monmouth County.\n\nThe house is also home to Warth's many cats and his wife's collection of antique clocks, both of which add a gothic atmosphere to the premises.\n\nA devotee of the unexplained from an early age, the 57-year-old man has been president of the society since 1975.\n\nIn addition to editing the magazine, Warth's duties as president involve taking phone calls from people who have suddenly had an encounter with the unknown.\n\n\"When we get a call, I'll screen the people to make sure they aren't part of the lunatic fringe. If it's a significant incident, we'll go to the site and investigate,\" said Warth, a professional chemist who receives no salary from the society.\n\nWhile screening calls, Warth keeps in mind that most people aren't accustomed to having dealings with the supernatural.\n\n\"Seeing a ghost for the first time can be pretty unnerving,\" he said matter-of-factly.\n\nWhen visiting a house suspected of being haunted, Warth brings along a psychic who can tell if there is a spiritual presence nearby. Warth also asks the homeowner to write down as much information as possible about the sighting and the history of the problem.\n\n\"People worry that having a ghost will lower their property values,\" Warth explained.\n\n\"The society can also provide assistance with the problem. Help, in most cases, usually involves gently informing the ghost that it is, in fact, dead, Warth said.\n\n\"A ghost basically feels they are still alive. They can't understand why there are strange people in their house. They don't like the changes that are being made so they annoy the residents,\" Warth said. A one-year membership in the society is $30 and includes a subscription to \"Pursuit.\"\n\nAnyone interested in joining should write: SITU URSUIT, P.O. Box 265, Little Silver, N.J. 07739-0265.",
      "location": "Little Silver, New Jersey",
      "tags": [
        "unexplained"
      ],
      "mythologization_score": 0.045000000000000005,
      "mythologized": false,
      "added": "2025-11-08T16:32:31.076146"
    },
    {
      "id": "nj_19880213_011",
      "headline": "Teens And A Self-Styled Satanism",
      "date": "1988-02-13",
      "source": "The News of Cumberland County",
      "text": "\"The mind is its own place, and in itself Can make a Heaven of Hell, a Hell of Heaven.\" - John Milton in \"Paradise Lost.\"\n\nBy LISA LEVITT RYCKMAN\nAP National Writer\n\nFive years ago, Colorado police destroyed evidence in a teen-age suicide when their cruiser tires obliterated occult symbols drawn with a stick in driveway gravel. Oklahoma investigators saved a few satanic drawings and writings by a boy who had killed his parents; relatives threw away the rest.\n\nThey know better now.\n\nPolice, parents, teachers and clergy have learned some tough lessons about hard-to-believe phenomenon as dark as it is complex. Violence and crime among teen-agers caught up in the occult, particularly a self-styled Satanism laced with drugs, savage rock music and a mish-mash of symbols and rituals, have adults talking seriously about the unspeakable.\n\n\"Three years ago, nobody wanted to hear it, nobody wanted to believe it was real,\" said San Francisco police Det. Sandi Gallant, who recently received four calls a day from around the country on crimes with satanic or occult overtones. \"Now I'm seeing them tuning into it, looking to see if it's a reality and finding it does exist.\"\n\nAuthorities around the country are seeing a rise of violence and crime among teen-agers caught up in the occult, particularly a self-styled Satanism laced with drugs, savage rock music and a mish-mash of symbols and rituals.\n\n\"The paranoid fantasy is becoming a major social problem,\" said Carl Raschke, director of the Institute of Humanities at the University of Denver. \"If you're looking for it, you don't see the evidence. But when you're looking for it, you see it everywhere.\"\n\nIn one month this winter, three Missouri teen-agers were charged with first-degree murder in the death of a classmate beaten with baseball bats and dumped into a cistern. A popular 15-year-old put a rifle to her head in Vermont. A New Jersey eighth-grader fatally stabbed his mother with a Boy Scout knife, then slit his throat and wrists.\n\n\"The kids will tell you themselves: 'What have we got to live for?' You've crammed religion down our throats. You've destroyed everything. You've built bombs that can wipe out the world. So we live for today,'\" said Denver police Det. Bill Wickersham. \"That's what Satanism says — 'Do what thou wilt.' \"\n\nAt Chicago-based Cult Awareness Network, every month brings news of a teen-ager involved in crime believed to be linked to devil worship. At least 10 percent of the 250 calls they receive each month are about satanic cults, a significant rise from previous years, said Cynthia Kisser, the group's executive director. \"I believe we're only getting the tip of the iceberg,\" said San Francisco's Gallant.\n\n\"I suspect we're only getting the tip of the iceberg,\" San Francisco's Gallant said. \"I believe for every one we're hearing about, there are five we haven't picked up on.\"\n\nIt's easy to see why. Thomas Carl Sullivan Jr., 14, a paperboy appeared to be a model son and student until a month before he killed his mother, Betty Ann, and himself. Michael Kimball, 15, before she put a bullet through her brain, was considered a giving, loving child who brought light into others' lives. James Hardy, one of three 17-year-olds charged in the beating death, was a senior and athlete at St. Thomas the Apostle High School in Kansas City.\n\nSatanism, which revels in evil, destruction, instant gratification and ritual guaranteed to shock parents, offers the ultimate rebellion.\n\n\"It's a shortcut to power, and the only thing you have to do is stick your neck out. There's this element of danger,\" said Linda Blood, a former member of the Temple of Set, a group of traditional Satanists.\n\n\"It's like the occult version of The Revenge of the Nerds.\" Are kids involved in self-styled Satanism — separated from the traditional religious Satanists, who are public about their beliefs and disapprove of criminal activity, and adult devil cults, which some observers believe use drugs and blackmail to lure desperate teenagers into drug-related crimes — seeking rebellion into the realm of the bizarre.\n\nSuffice it, for example, became \"Malakas,\" adopting some of the outward trappings: black clothing, inverted crosses, encircled pentagrams, goat heads or the number 666 worn as jewelry or drawn on notebooks.\n\nSome rob graveyards to get what they need.\n\nDrugs play a major role, especially amphetamines, PCP and hallucinogens such as acid. Satanism and drugs were the glue for the Purple Knights, a gang of Denver-area teen-agers, some as young as 12, involved in burglaries, suicide attempts, auto theft and arson.\n\nPlease see 'Satanism, page 2",
      "location": "Various NJ locations",
      "tags": [
        "youth_crime",
        "satanism",
        "rock_bands",
        "mental_health",
        "psychedelics"
      ],
      "mythologization_score": 0.31500000000000006,
      "mythologized": false,
      "added": "2025-11-08T16:55:50.123906"
    },
    {
      "id": "nj_19920428_012",
      "headline": "Sussex Borough police officers plead not guilty in drug scandal",
      "date": "1992-04-28",
      "source": "Daily Record",
      "text": "Two Sussex Borough police officers charged in drug scandal pleaded not guilty and will remain free on recognizance bonds. The borough council suspended officers without pay after grand jury indictment. Patrolman Michael Curcio, 30, charged with theft, distribution and possession of cocaine from department evidence locker. Chief Mark Van Engelen, 40, charged with official misconduct and hindering prosecution. Van Engelen had ordered his three officers to burn and bury all drugs stored in locker. Evidence relating to alleged thefts destroyed in burning. Council scrambling to make permanent police protection arrangements for drug-scarred borough of 2,000 people. Council voted to disband department as soon as new arrangements made.",
      "location": "Newton, New Jersey",
      "tags": [
        "youth_crime",
        "drugs"
      ],
      "mythologization_score": 0.0,
      "mythologized": false,
      "added": "2025-11-08T17:02:52.677379"
    },
    {
      "id": "nj_19860717_013",
      "headline": "The lighting manager for the rock band Atlanta Rhythm Section was crushed to death",
      "date": "1986-07-17",
      "source": "The Central New Jersey Home News",
      "text": "The lighting manager for the rock band Atlanta Rhythm Section was crushed to death when the band's lighting equipment collapsed on top of him on the stage of the New Jersey theater where the group was to perform last night, police said.",
      "location": "New Jersey",
      "tags": [
        "rock_bands",
        "unexplained"
      ],
      "mythologization_score": 0.1,
      "mythologized": false,
      "added": "2025-11-08T17:03:00.942429"
    }
  ],
  "metadata": {
    "created": "2025-11-08T09:22:45.408499",
    "version": "1.0"
  }
}